In [1]:
a=10
b=20
c=a+b
print(c)

30

In [ ]:
================ EDA =================================
1) pandas     : dataframe or data applications
2) numpy      : numerical python for math operations
3) matplotlib : for plots graphs
4) seaborn    : for plots graphs
5) bokhe      : for plots
6) plotly     : for plots

In [ ]:
============== Machine Learning =================
7) scikit learn (sklearn)   : Ml models
8) stats                    : statistical models

In [ ]:
================ Data retrival from sql scrapping ====================
9) sqlite     :   connect with database
10) Beautiful soup : scrap the data from website
11) websocket : scrap

In [ ]:
================ Deep learning / computer vision =====================
12) Tensorflow      : google
13) keras           : dl models
14) opencv          : image operations 
15) pillow (pil)    : Image operations
16) pytorch         : Facebook
17) pretrained models : VGG16,Mobilnet,RESNET,RCNN,MASKRCNN,FASTERCNN,YOLO

In [ ]:
================== Natural language process ===========================
18) NLTK        : natural language process
19) scipy       
20) word2vec (how words will convert into vectors):
21) glove
22) wordcloud

In [ ]:
===================== Hugging face =========================
23) Transformers   : BERT

In [ ]:
==================== Gen AI models ==========================
24) openAI + Microsoft   : GPT models
25) Google               : Gemini
26) Amazon               : Q
27) Meta Facebook        : Meta AI
28) Apple                

LLAMA
GEMMA
Dalle-E
TS

ALL ARE HAVING DIFFERENT DIFFERENT PACKAGES

In [ ]:
===================== LANGCHAIN ======================
29) Langchain Framework

In [ ]:
===================== Deployments/applications =========================
30) Flask
31) Streamlit
32) Django

In [ ]:
===================== MLops ======================
33) Mlflow
34) Kuberflow
35) Azure AI services : Azure packages
36) GCP : GCP packages

**import pandas**

**step-1**
**create a Dataframe**

- we will create a dataframe using list
- we will create a dataframe using dictionary

In [4]:
import pandas as pd

In [5]:
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [6]:
type(d1)

pandas.core.frame.DataFrame

**step-2**

**provide the Data**

In [7]:
names=['yashu','suri','neeru']
pd.DataFrame(names)

       0
0  yashu
1   suri
2  neeru

In [9]:
names=['tarun','surendar','mohith']
age=[20,21,22]
data=zip(names,age)
pd.DataFrame(data)

          0   1
0     tarun  20
1  surendar  21
2    mohith  22

In [10]:
names=['yashu','suri','neeru']
age=[22,21,20]
city=['hyd','bgl','goa']
pd.DataFrame(zip(names,age,city))

       0   1    2
0  yashu  22  hyd
1   suri  21  bgl
2  neeru  20  goa

**step-3**

**provide the Column names**

In [12]:
names=['yashu','suri','neeru']
pd.DataFrame(names,
             columns=['Names'])

   Names
0  yashu
1   suri
2  neeru

In [13]:
names=['yashu','suri','neeru']
age=[22,21,20]
city=['hyd','bgl','goa']
data=zip(names,age,city)
pd.DataFrame(data,columns=['name','age','city'])

    name  age city
0  yashu   22  hyd
1   suri   21  bgl
2  neeru   20  goa

In [14]:
names=['yashu','suri','neeru']
age=[22,21,20]
city=['hyd','bgl','goa']
data=zip(names,age,city)
cols=['name','age','city']
pd.DataFrame(data,columns=cols)

    name  age city
0  yashu   22  hyd
1   suri   21  bgl
2  neeru   20  goa

**step-4**

**providing index**

In [17]:
names=['yashu','meghu','neeru']
age=[20,21,22]
city=['Hyd','ECIL','Blr']
data=zip(names,age,city)
ix=['A','B','C'] # 3 rows we need 3 index
cols=['Names','Age','City'] # 3 columns , 3 values
pd.DataFrame(data,
index=ix,
columns=cols)

   Names  Age  City
A  yashu   20   Hyd
B  meghu   21  ECIL
C  neeru   22   Blr

In [ ]:
names=['tarun','surendar','mohith']
pd.DataFrame(names)
names=['tarun','surendar','mohith']
pd.DataFrame(names,
columns=['Names'])
# Why names is passing in list format if we have 1 column only--
##################################################################
names=['tarun','surendar','mohith']
age=[20,21,22]
pd.DataFrame(zip(names,age),
columns=['Names','Age'])
#############################################
names=['tarun','surendar','mohith']
age=[20,21,22]
city=['Hyd','ECIL','Blr']
data=zip(names,age,city)
cols=['Names','Age','City']
pd.DataFrame(data,columns=cols)

In [21]:
name = ['suri', 'meghu', 'meghu']
age = [20, 35, 12]
city = ['Hyd', 'Blr', 'Chn']
data = zip(name, age)
column=['Name', 'Age']
df=pd.DataFrame(data, index=city, columns=column)
df

      Name  Age
Hyd   suri   20
Blr  meghu   35
Chn  meghu   12

- create a dataframe
- provide the data
- add the columns
- provide the column names
- provide index

In [22]:
import pandas as pd

In [23]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

**step-5**

**Add a New column on existing data frame**

In [25]:
# create a data frame with name,age,city

import pandas as pd
names=['yashu','suri','pranu']
age=[22,21,20]
city=['hyd','bgl','goa']
data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,columns=cols)
df

   Names  Age City
0  yashu   22  hyd
1   suri   21  bgl
2  pranu   20  goa

- if u want to add new column
- first check how many rows are there
- for example in above dataframe we have 3 rows
- your new column also should have 3 rows
- suppose i want to create a new column called salary
- make a list of salary with 3 values
- salary=[100000,200000,300000]

**syntax**:dataframe[column]=list of values

- salary=[100000,200000,300000]
- df['salary']=salary

In [50]:
salary=[10000,20000,30000]
df['salary']=salary
df

       0   1    2  salary
0  yashu  22  hyd   10000
1   suri  21  bgl   20000
2  neeru  20  goa   30000

**use case-1**

- create empty data frame first
- create 3 list using list comprehension
- list1= a values from 1 to 10
- list2=square of 1 to 10
- list3=cube of 1 to 10
- finally make a dataframe

In [26]:
import pandas as pd
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [27]:
l1=[i for i in range(1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range(1,10)]
df1['X']=l1
df1['Y']=l2
df1['Z']=l3
df1

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125
5  6  36  216
6  7  49  343
7  8  64  512
8  9  81  729

**step-6**

**update the already existed column**

- create a new cloumn
- creating a new list salary=[1000,2000,3000]
- df=['s']
- creating a new cloumn the cloumn name is our choice
- update existing column are same way only
- here also we need a make a list of values = number of rows
- while updating the existing cloumn
- we need to provide already existed column name only
- df=['z']=list of values

In [28]:
# dataframe name: df1
# list of values variable name: z
# which column we want to update : Z'
z=[i**4 for i in range(1,10)]
df1['Z']=z
df1

   X   Y     Z
0  1   1     1
1  2   4    16
2  3   9    81
3  4  16   256
4  5  25   625
5  6  36  1296
6  7  49  2401
7  8  64  4096
8  9  81  6561

In [29]:
df2=pd.DataFrame()
l1=[i for i in range(1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range(1,10)]
df2['Number']=l1
df2['Square']=l2
df2['Cube']=l3
df2
# use list comprehension to crea
# use list comprehension to cr
# use list comprehension to creat
# create column headings X,Y,

   Number  Square  Cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
4       5      25   125
5       6      36   216
6       7      49   343
7       8      64   512
8       9      81   729

**step-7**

**how to drop a column**

In [30]:
df1.columns # hwo to check the columns

Index(['X', 'Y', 'Z'], dtype='object')

- if u want to drop a specific column
- we will use drop method
- we already know about diffrent between keywords and methods
- keyword will use directly
- methods will use corresponding dataframe

**method name is drop**

df.drop()

- column: which column you want to drop
- axis: axis represents the specified value is a row or column
- axis= 0 means rows
- axis= 1 means column
- by default axis=0
- inplace: will provide overwrite the dataframe or not
- inplace=true , this indicates overwrite the dataframe
- inplace=false, this indicates modified dataframe wil be use when you provide new variable for the operation

In [32]:
df1.drop('X')
# we are not providing axis
# it assuming the provided value is a row
# by default axis=0 ==== rows

KeyError: "['X'] not found in axis"

In [33]:
df1.drop('X',axis=1)
# after this in a new cell type df1
# you will see original dataframe
# because we did not provide inplace
# If you want to use below output
# you need to assign a variable
#df_new=df1.drop('X',axis=1)

    Y     Z
0   1     1
1   4    16
2   9    81
3  16   256
4  25   625
5  36  1296
6  49  2401
7  64  4096
8  81  6561

In [35]:
df1.drop('X',axis=1,inplace=True)
df1

    Y     Z
0   1     1
1   4    16
2   9    81
3  16   256
4  25   625
5  36  1296
6  49  2401
7  64  4096
8  81  6561

**step-8**

**drop the row**

- drop the column and drop the row both are similar only
- the only difference is axis
- axis=0 represents rows
- by default axis=0 available
- which means if we provide any value it will represent rows only

In [65]:
df

   number   cube
0       1      1
1       2     16
2       3     81
3       4    256
4       5    625
5       6   1296
6       7   2401
7       8   4096
8       9   6561
9      10  10000

In [66]:
import pandas as pd
df

   number   cube
0       1      1
1       2     16
2       3     81
3       4    256
4       5    625
5       6   1296
6       7   2401
7       8   4096
8       9   6561
9      10  10000

**step-9**

**how to select the column**

In [67]:
df['Number']

# series type
# no column name display
# whenever u see this type : series type

KeyError: 'Number'

In [64]:
type(df['Number'])

KeyError: 'Number'

In [68]:
cols=['Number','Square']
df[cols]

KeyError: "None of [Index(['Number', 'Square'], dtype='object')] are in the [columns]"

In [69]:
df['Number'].values

KeyError: 'Number'

In [70]:
df

   number   cube
0       1      1
1       2     16
2       3     81
3       4    256
4       5    625
5       6   1296
6       7   2401
7       8   4096
8       9   6561
9      10  10000

In [72]:
df.drop(3)

   number   cube
0       1      1
1       2     16
2       3     81
4       5    625
5       6   1296
6       7   2401
7       8   4096
8       9   6561
9      10  10000

- all the values come in array
- array means it is a list of elements only represnts using numpy package
- generally element present in 4 ways
- list : basic represntation
- numpy array : array with numpy packages
- tensors : tensorflow package
- torch : pytorch package

In [82]:
list1=[1,2,3,4,5]
list2=[6,7,8,9,10]
list1+list2

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [81]:
import numpy as np
np.array(list1)

array([1, 2, 3, 4, 5])

In [83]:
l1=np.array(list1)
l2=np.array(list2)
l1+l2

array([ 7,  9, 11, 13, 15])

**how to save the data frame**

In [98]:
df.to_csv('Data1.csv')
df.to_excel('Data1.xlsx')

In [99]:
import pandas as pd
pd.read_csv('Data1.csv')

   Unnamed: 0  number   cube
0           0       1      1
1           1       2     16
2           2       3     81
3           3       4    256
4           4       5    625
5           5       6   1296
6           6       7   2401
7           7       8   4096
8           8       9   6561
9           9      10  10000

In [100]:
import pandas as pd
pd.read_excel('Data1.xlsx')

   Unnamed: 0  number   cube
0           0       1      1
1           1       2     16
2           2       3     81
3           3       4    256
4           4       5    625
5           5       6   1296
6           6       7   2401
7           7       8   4096
8           8       9   6561
9           9      10  10000

In [ ]:
#step-12

# how to avoid index column
# while we save the dataframe
# automatically a new column will create we nee to avoid

In [102]:
import pandas as pd
pd.read_csv('Data1.csv',index=False)
pd.read_excel('Data1.xlsx',index=False)

TypeError: read_csv() got an unexpected keyword argument 'index'

In [103]:
import pandas as pd
pd.read_csv('Data1.csv')

   Unnamed: 0  number   cube
0           0       1      1
1           1       2     16
2           2       3     81
3           3       4    256
4           4       5    625
5           5       6   1296
6           6       7   2401
7           7       8   4096
8           8       9   6561
9           9      10  10000

In [104]:
import pandas as pd
pd.read_excel('Data1.xlsx')

   Unnamed: 0  number   cube
0           0       1      1
1           1       2     16
2           2       3     81
3           3       4    256
4           4       5    625
5           5       6   1296
6           6       7   2401
7           7       8   4096
8           8       9   6561
9           9      10  10000